# 4. Начните работу над проектом «Склад оргтехники». Создайте класс, описывающий склад.
# А также класс «Оргтехника», который будет базовым для классов-наследников.
# Эти классы — конкретные типы оргтехники (принтер, сканер, ксерокс).
# В базовом классе определите параметры, общие для приведённых типов.
# В классах-наследниках реализуйте параметры, уникальные для каждого типа оргтехники.

# class Warehouse:
#     pass
#
#
# class OfficeEquipment:
#     name = "Оргтехника"
#
#
# class Printer(OfficeEquipment):
#     name = "Принтеры"
#
#
# class Scanner(OfficeEquipment):
#     name = "Сканеры"
#
#
# class Xerox(OfficeEquipment):
#     name = "Ксероксы"
#
#
